Revit 2026 API

# ExporterIFCSetCurrentExportedDocument Method

---

Sets the exporter to process a particular document during export.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCurrentExportedDocument(
	Document pDocument
)
```
```vb
Public Sub SetCurrentExportedDocument (
	pDocument As Document
)
```
```cpp
public:
void SetCurrentExportedDocument(
	Document^ pDocument
)
```
```fsharp
member SetCurrentExportedDocument :
        pDocument : Document -> unit
```

#### Parameters

pDocument Document
     The document being processed.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This is intended for use in federated export.

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace